The  StructuralSectionUtils  type exposes the following members.
 Methods
Name  |   Description
GetStructuralSection
 Return structural section from element.
SetStructuralSection
 Set structural section in element.
 See Also
  StructuralSectionUtils Class
  Autodesk.Revit.DB.Structure.StructuralSections Namespace